-- 选择性修复 矿点 挖掘次数
update gameobject_template qt
set qt.data4 = 5, qt.data5 = 7
WHERE entry in(324,1610,1731,1732,1733,1734,1735,2040,2047,2054,2055,2653,3763,3764,19903,73940,73941,103711,103713,105569,123309,123310,123848,150079,150080,150081,150082,165658,176643,176645,181108,181249,181555,181556,181557,185557,185877
);
-- 删除装备或者坐骑 道具，目前没有战场奖章，这些道具都不可能购买到
delete from tbccharacters.item_instance WHERE itemEntry in(19031, 19312,19083,19085,19095,19096,19087,19088,19089,19090,19316,19317,19046,19103,19099,19101,19320,19319,19029,19315,19308,19311,19309,19310,19323,19321,19325,19324,21563,19084,19032,19086,19097,19098,19091,19092,19093,19094,19045,19100,19102,19104,19030);
delete FROM tbccharacters.character_inventory WHERE item_template in (19031, 19312,19083,19085,19095,19096,19087,19088,19089,19090,19316,19317,19046,19103,19099,19101,19320,19319,19029,19315,19308,19311,19309,19310,19323,19321,19325,19324,21563,19084,19032,19086,19097,19098,19091,19092,19093,19094,19045,19100,19102,19104,19030);


-- 限制副本
-- 海加尔	534
-- 风暴要塞	550
-- 毒蛇神殿	548
-- 黑暗神殿	564
-- 祖阿曼	568
-- 太阳之井高地	580

update tbcmangos.areatrigger_teleport a
set a.required_level = a.required_level + 10
where a.target_map in(
                      534    ,
                      550    ,
                      548    ,
                      564    ,
                      568    ,
                      580
    );
update tbcmangos.instance_template i
set i.levelMin = i.levelMin + 10
where i.map in(
               534    ,
               550    ,
               548    ,
               564    ,
               568    ,
               580
    );
-- pvp s1-s4
update tbcmangos.game_event  g
set g.length = 0
where g.entry in (53, 54, 55, 56);